benchmark/experiment-3/10000ms-tmaret-002-fibers-unbounded-250.txt
Running 25s test @ http://tmaret-002-fibers-unbounded.ns-team-aemdevreplication.svc.cluster.local:8080/sync?cpuIterations=133000&idleDelay=9600&fileLength=1000000
  250 threads and 250 connections
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
[...]
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    17.86s     4.21s   24.46s    56.74%
    Req/Sec     0.08      2.88   111.00     99.92%
  319 requests in 26.01s, 304.30MB read
  Socket errors: connect 0, read 0, write 0, timeout 108
Requests/sec:     12.26
Transfer/sec:     11.70MB