benchmark/experiment-3/10000ms-tmaret-002-kernel-1000-250.txt
Running 25s test @ http://tmaret-002-kernel-1000.ns-team-aemdevreplication.svc.cluster.local:8080/sync?cpuIterations=133000&idleDelay=9600&fileLength=1000000
  250 threads and 250 connections
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
[...]
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    21.43s   591.04ms  22.02s    86.00%
    Req/Sec     0.07      2.61   111.00     99.94%
  250 requests in 26.01s, 238.48MB read
Requests/sec:      9.61
Transfer/sec:      9.17MB