benchmark/experiment-3/10ms-tmaret-002-kernel-1000-100.txt
Running 25s test @ http://tmaret-002-kernel-1000.ns-team-aemdevreplication.svc.cluster.local:8080/sync?cpuIterations=133&idleDelay=9&fileLength=1000
  100 threads and 100 connections
  Thread calibration: mean lat.: 3777.987ms, rate sampling interval: 11132ms
  Thread calibration: mean lat.: 3792.294ms, rate sampling interval: 11182ms
  Thread calibration: mean lat.: 3801.359ms, rate sampling interval: 11214ms
  Thread calibration: mean lat.: 3788.047ms, rate sampling interval: 11190ms
  Thread calibration: mean lat.: 3835.109ms, rate sampling interval: 11272ms
  Thread calibration: mean lat.: 3850.958ms, rate sampling interval: 11313ms
  Thread calibration: mean lat.: 3851.984ms, rate sampling interval: 11255ms
  Thread calibration: mean lat.: 3766.878ms, rate sampling interval: 11149ms
  Thread calibration: mean lat.: 3786.638ms, rate sampling interval: 11198ms
  Thread calibration: mean lat.: 3818.296ms, rate sampling interval: 11206ms
  Thread calibration: mean lat.: 3754.195ms, rate sampling interval: 11091ms
  Thread calibration: mean lat.: 3705.476ms, rate sampling interval: 11001ms
  Thread calibration: mean lat.: 3798.440ms, rate sampling interval: 11157ms
  Thread calibration: mean lat.: 3791.287ms, rate sampling interval: 11247ms
  Thread calibration: mean lat.: 3770.688ms, rate sampling interval: 11132ms
  Thread calibration: mean lat.: 3842.345ms, rate sampling interval: 11288ms
  Thread calibration: mean lat.: 3812.941ms, rate sampling interval: 11206ms
  Thread calibration: mean lat.: 3743.586ms, rate sampling interval: 11116ms
  Thread calibration: mean lat.: 3803.502ms, rate sampling interval: 11182ms
  Thread calibration: mean lat.: 3728.373ms, rate sampling interval: 11083ms
  Thread calibration: mean lat.: 3727.148ms, rate sampling interval: 11059ms
  Thread calibration: mean lat.: 3797.052ms, rate sampling interval: 11198ms
  Thread calibration: mean lat.: 3711.893ms, rate sampling interval: 11059ms
  Thread calibration: mean lat.: 3788.072ms, rate sampling interval: 11190ms
  Thread calibration: mean lat.: 3800.742ms, rate sampling interval: 11173ms
  Thread calibration: mean lat.: 3736.070ms, rate sampling interval: 11108ms
  Thread calibration: mean lat.: 3735.313ms, rate sampling interval: 11067ms
  Thread calibration: mean lat.: 3819.952ms, rate sampling interval: 11247ms
  Thread calibration: mean lat.: 3780.270ms, rate sampling interval: 11165ms
  Thread calibration: mean lat.: 3778.094ms, rate sampling interval: 11173ms
  Thread calibration: mean lat.: 3766.810ms, rate sampling interval: 11116ms
  Thread calibration: mean lat.: 3827.818ms, rate sampling interval: 11223ms
  Thread calibration: mean lat.: 3800.146ms, rate sampling interval: 11190ms
  Thread calibration: mean lat.: 3837.937ms, rate sampling interval: 11247ms
  Thread calibration: mean lat.: 3814.444ms, rate sampling interval: 11223ms
  Thread calibration: mean lat.: 3792.213ms, rate sampling interval: 11173ms
  Thread calibration: mean lat.: 3786.844ms, rate sampling interval: 11198ms
  Thread calibration: mean lat.: 3840.923ms, rate sampling interval: 11288ms
  Thread calibration: mean lat.: 3818.482ms, rate sampling interval: 11198ms
  Thread calibration: mean lat.: 3795.272ms, rate sampling interval: 11173ms
  Thread calibration: mean lat.: 3787.199ms, rate sampling interval: 11141ms
  Thread calibration: mean lat.: 3830.696ms, rate sampling interval: 11239ms
  Thread calibration: mean lat.: 3832.433ms, rate sampling interval: 11239ms
  Thread calibration: mean lat.: 3860.138ms, rate sampling interval: 11280ms
  Thread calibration: mean lat.: 3848.376ms, rate sampling interval: 11288ms
  Thread calibration: mean lat.: 3711.704ms, rate sampling interval: 11010ms
  Thread calibration: mean lat.: 3112.714ms, rate sampling interval: 9650ms
  Thread calibration: mean lat.: 3724.543ms, rate sampling interval: 11042ms
  Thread calibration: mean lat.: 3789.468ms, rate sampling interval: 11165ms
  Thread calibration: mean lat.: 3836.519ms, rate sampling interval: 11280ms
  Thread calibration: mean lat.: 3747.663ms, rate sampling interval: 11075ms
  Thread calibration: mean lat.: 3783.334ms, rate sampling interval: 11182ms
  Thread calibration: mean lat.: 3752.096ms, rate sampling interval: 11075ms
  Thread calibration: mean lat.: 3786.968ms, rate sampling interval: 11157ms
  Thread calibration: mean lat.: 3832.672ms, rate sampling interval: 11296ms
  Thread calibration: mean lat.: 3843.287ms, rate sampling interval: 11239ms
  Thread calibration: mean lat.: 3817.000ms, rate sampling interval: 11206ms
  Thread calibration: mean lat.: 3793.553ms, rate sampling interval: 11206ms
  Thread calibration: mean lat.: 3813.102ms, rate sampling interval: 11198ms
  Thread calibration: mean lat.: 3785.017ms, rate sampling interval: 11165ms
  Thread calibration: mean lat.: 3772.911ms, rate sampling interval: 11141ms
  Thread calibration: mean lat.: 3811.048ms, rate sampling interval: 11206ms
  Thread calibration: mean lat.: 3763.364ms, rate sampling interval: 11075ms
  Thread calibration: mean lat.: 3803.103ms, rate sampling interval: 11182ms
  Thread calibration: mean lat.: 3829.915ms, rate sampling interval: 11247ms
  Thread calibration: mean lat.: 3773.269ms, rate sampling interval: 11198ms
  Thread calibration: mean lat.: 3793.594ms, rate sampling interval: 11214ms
  Thread calibration: mean lat.: 3769.197ms, rate sampling interval: 11100ms
  Thread calibration: mean lat.: 3799.758ms, rate sampling interval: 11190ms
  Thread calibration: mean lat.: 3739.937ms, rate sampling interval: 11132ms
  Thread calibration: mean lat.: 3746.514ms, rate sampling interval: 11091ms
  Thread calibration: mean lat.: 3717.566ms, rate sampling interval: 11018ms
  Thread calibration: mean lat.: 3706.906ms, rate sampling interval: 11018ms
  Thread calibration: mean lat.: 3757.199ms, rate sampling interval: 11149ms
  Thread calibration: mean lat.: 3708.034ms, rate sampling interval: 11034ms
  Thread calibration: mean lat.: 3775.664ms, rate sampling interval: 11165ms
  Thread calibration: mean lat.: 3774.851ms, rate sampling interval: 11173ms
  Thread calibration: mean lat.: 3744.699ms, rate sampling interval: 11100ms
  Thread calibration: mean lat.: 3770.320ms, rate sampling interval: 11132ms
  Thread calibration: mean lat.: 3735.759ms, rate sampling interval: 11083ms
  Thread calibration: mean lat.: 3759.381ms, rate sampling interval: 11198ms
  Thread calibration: mean lat.: 3829.216ms, rate sampling interval: 11263ms
  Thread calibration: mean lat.: 3777.578ms, rate sampling interval: 11198ms
  Thread calibration: mean lat.: 3798.835ms, rate sampling interval: 11272ms
  Thread calibration: mean lat.: 3801.754ms, rate sampling interval: 11206ms
  Thread calibration: mean lat.: 3736.155ms, rate sampling interval: 11067ms
  Thread calibration: mean lat.: 3787.840ms, rate sampling interval: 11214ms
  Thread calibration: mean lat.: 3665.998ms, rate sampling interval: 10936ms
  Thread calibration: mean lat.: 3715.683ms, rate sampling interval: 11018ms
  Thread calibration: mean lat.: 3806.869ms, rate sampling interval: 11165ms
  Thread calibration: mean lat.: 3799.812ms, rate sampling interval: 11214ms
  Thread calibration: mean lat.: 3753.337ms, rate sampling interval: 11124ms
  Thread calibration: mean lat.: 3801.092ms, rate sampling interval: 11190ms
  Thread calibration: mean lat.: 3753.641ms, rate sampling interval: 11075ms
  Thread calibration: mean lat.: 3753.759ms, rate sampling interval: 11141ms
  Thread calibration: mean lat.: 3801.022ms, rate sampling interval: 11198ms
  Thread calibration: mean lat.: 3774.644ms, rate sampling interval: 11141ms
  Thread calibration: mean lat.: 3765.647ms, rate sampling interval: 11141ms
  Thread calibration: mean lat.: 3785.781ms, rate sampling interval: 11165ms
  Thread calibration: mean lat.: 3744.378ms, rate sampling interval: 11132ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.73s     2.16s   13.59s    57.82%
    Req/Sec    99.17      0.60   100.00    100.00%
  229435 requests in 24.90s, 272.41MB read
Requests/sec:   9214.44
Transfer/sec:     10.94MB